lvgl/lv_stm/lv_port_stm32mp135f_disco_bm/Drivers/BSP/Components/gt911/gt911_reg.h
/**
 ******************************************************************************
 * @file    gt911_reg.h
 * @author  MCD Application Team
 * @brief   Header of gt911_reg.c
 *
 ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef GT911_REG_H
#define GT911_REG_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* Macros --------------------------------------------------------------------*/

/** @addtogroup BSP
 * @{
 */

/** @addtogroup Component
 * @{
 */

/** @addtogroup GT911
 * @{
 */

/* Exported types ------------------------------------------------------------*/

/** @defgroup GT911_Exported_Types GT911 Exported Types
 * @{
 */
/************** Generic Function  *******************/

typedef int32_t (*GT911_Write_Func)(void *, uint16_t, uint8_t*, uint16_t);
typedef int32_t (*GT911_Read_Func) (void *, uint16_t, uint8_t*, uint16_t);

/**
 * @}
 */

/** @defgroup GT911_Imported_Globals GT911 Imported Globals
 * @{
 */
typedef struct
{
  GT911_Write_Func   WriteReg;
  GT911_Read_Func    ReadReg;
  void                *handle;
} gt911_ctx_t;
/**
 * @}
 */

/** @defgroup GT911_Exported_Constants GT911 Exported Constants
 * @{
 */

/* Current mode register of the GT911 (R/W) */
#define GT911_DEV_MODE_REG         0x00

/* Gesture ID register */
#define GT911_GEST_ID_REG          0x01

/* Touch Data Status register : gives number of active touch points (0..5) */
#define GT911_TD_STAT_REG          0x814EU

/* P1 X, Y coordinates, weight(Point size) and track-id registers */
#define GT911_P1_XL_REG            0x8150U
#define GT911_P1_XH_REG            0x8151U
#define GT911_P1_YL_REG            0x8152U
#define GT911_P1_YH_REG            0x8153U
#define GT911_P1_WEIGHTL_REG       0x8154U
#define GT911_P1_WEIGHTH_REG       0x8155U
#define GT911_P1_TID_REG           0x8157U

/* P2 X, Y coordinates, weight and misc registers */
#define GT911_P2_XH_REG            0x09U
#define GT911_P2_XL_REG            0x0AU
#define GT911_P2_YH_REG            0x0BU
#define GT911_P2_YL_REG            0x0CU
#define GT911_P2_WEIGHT_REG        0x0DU
#define GT911_P2_MISC_REG          0x0EU

/* P3 X, Y coordinates, weight and misc registers */
#define GT911_P3_XH_REG            0x0FU
#define GT911_P3_XL_REG            0x10U
#define GT911_P3_YH_REG            0x11U
#define GT911_P3_YL_REG            0x12U
#define GT911_P3_WEIGHT_REG        0x13U
#define GT911_P3_MISC_REG          0x14U

/* P4 X, Y coordinates, weight and misc registers */
#define GT911_P4_XH_REG            0x15U
#define GT911_P4_XL_REG            0x16U
#define GT911_P4_YH_REG            0x17U
#define GT911_P4_YL_REG            0x18U
#define GT911_P4_WEIGHT_REG        0x19U
#define GT911_P4_MISC_REG          0x1AU

/* P5 X, Y coordinates, weight and misc registers */
#define GT911_P5_XH_REG            0x1BU
#define GT911_P5_XL_REG            0x1CU
#define GT911_P5_YH_REG            0x1DU
#define GT911_P5_YL_REG            0x1EU
#define GT911_P5_WEIGHT_REG        0x1FU
#define GT911_P5_MISC_REG          0x20U

/* P6 X, Y coordinates, weight and misc registers */
#define GT911_P6_XH_REG            0x21U
#define GT911_P6_XL_REG            0x22U
#define GT911_P6_YH_REG            0x23U
#define GT911_P6_YL_REG            0x24U
#define GT911_P6_WEIGHT_REG        0x25U
#define GT911_P6_MISC_REG          0x26U

/* P7 X, Y coordinates, weight and misc registers */
#define GT911_P7_XH_REG            0x27U
#define GT911_P7_XL_REG            0x28U
#define GT911_P7_YH_REG            0x29U
#define GT911_P7_YL_REG            0x2AU
#define GT911_P7_WEIGHT_REG        0x2BU
#define GT911_P7_MISC_REG          0x2CU

/* P8 X, Y coordinates, weight and misc registers */
#define GT911_P8_XH_REG            0x2DU
#define GT911_P8_XL_REG            0x2EU
#define GT911_P8_YH_REG            0x2FU
#define GT911_P8_YL_REG            0x30U
#define GT911_P8_WEIGHT_REG        0x31U
#define GT911_P8_MISC_REG          0x32U

/* P9 X, Y coordinates, weight and misc registers */
#define GT911_P9_XH_REG            0x33U
#define GT911_P9_XL_REG            0x34U
#define GT911_P9_YH_REG            0x35U
#define GT911_P9_YL_REG            0x36U
#define GT911_P9_WEIGHT_REG        0x37U
#define GT911_P9_MISC_REG          0x38U

/* P10 X, Y coordinates, weight and misc registers */
#define GT911_P10_XH_REG           0x39U
#define GT911_P10_XL_REG           0x3AU
#define GT911_P10_YH_REG           0x3BU
#define GT911_P10_YL_REG           0x3CU
#define GT911_P10_WEIGHT_REG       0x3DU
#define GT911_P10_MISC_REG         0x3EU

/* Threshold for touch detection */
#define GT911_TH_GROUP_REG         0x80

/* Filter function coefficients */
#define GT911_TH_DIFF_REG          0x85

/* Control register */
#define GT911_CTRL_REG             0x86

/* The time period of switching from Active mode to Monitor mode when there is no touching */
#define GT911_TIMEENTERMONITOR_REG 0x87

/* Report rate in Active mode */
#define GT911_PERIODACTIVE_REG     0x88

/* Report rate in Monitor mode */
#define GT911_PERIODMONITOR_REG    0x89

/* The value of the minimum allowed angle while Rotating gesture mode */
#define GT911_RADIAN_VALUE_REG     0x91

/* Maximum offset while Moving Left and Moving Right gesture */
#define GT911_OFFSET_LR_REG        0x92

/* Maximum offset while Moving Up and Moving Down gesture */
#define GT911_OFFSET_UD_REG        0x93

/* Minimum distance while Moving Left and Moving Right gesture */
#define GT911_DISTANCE_LR_REG      0x94

/* Minimum distance while Moving Up and Moving Down gesture */
#define GT911_DISTANCE_UD_REG      0x95

/* Maximum distance while Zoom In and Zoom Out gesture */
#define GT911_DISTANCE_ZOOM_REG    0x96

/* High 8-bit of LIB Version info */
#define GT911_LIB_VER_H_REG        0xA1

/* Low 8-bit of LIB Version info */
#define GT911_LIB_VER_L_REG        0xA2

/* Chip Selecting */
#define GT911_CIPHER_REG           0xA3

/* Module_Switch1 register for Interrupt */
#define GT911_MSW1_REG             0x804D

/* Current power mode the GT911 system is in (R) */
#define GT911_PWR_MODE_REG         0xA5

/* GT911 firmware version */
#define GT911_FIRMID_REG           0x8144

/* GT911 Chip identification register */
#define GT911_CHIP_ID_REG          0x8140

/* Release code version */
#define GT911_RELEASE_CODE_ID_REG  0xAF

/* Current operating mode the GT911 system is in (R) */
#define GT911_COMMAND_REG          0x8040

/* Coordinates report rate (= 5+N ms) */
#define GT911_REFRESH_RATE_REG     0x8056U
#define GT911_REFRESH_RATE_MSK     0x0FU


/**
 * @}
 */

