lvgl/lv_stm/lv_port_stm32mp135f_disco_bm/Drivers/BSP/Components/gt911/gt911_reg.h
/*******************************************************************************
* Register      : P5_WEIGHT
* Address       : 0X1F
* Bit Group Name: Fifth Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   GT911_P5_WEIGHT_BIT_MASK        0xFFU
#define   GT911_P5_WEIGHT_BIT_POSITION    0
int32_t gt911_p5_weight(gt911_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_MISC
* Address       : 0X20
* Bit Group Name: Fifth Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   GT911_P5_MISC_BIT_MASK        0xF0U
#define   GT911_P5_MISC_BIT_POSITION    4
int32_t gt911_p5_misc(gt911_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : TH_GROUP
* Address       : 0X80
* Bit Group Name: Threshold for touch detection
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   GT911_TH_GROUP_BIT_MASK        0xFFU
#define   GT911_TH_GROUP_BIT_POSITION    0
int32_t gt911_th_group(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : TH_DIFF
* Address       : 0X85
* Bit Group Name: Filter function coefficient
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   GT911_TH_DIFF_BIT_MASK        0xFFU
#define   GT911_TH_DIFF_BIT_POSITION    0
int32_t gt911_th_diff(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : CTRL
* Address       : 0X86
* Bit Group Name:
* Permission    : RW
* Default value : 0x01
*******************************************************************************/
#define   GT911_CTRL_BIT_MASK           0xFFU
#define   GT911_CTRL_BIT_POSITION       0
int32_t gt911_ctrl(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : TIMEENTERMONITOR
* Address       : 0X87
* Bit Group Name:
* Permission    : RW
* Default value : 0x0A
*******************************************************************************/
#define   GT911_TIMEENTERMONITOR_BIT_MASK           0xFFU
#define   GT911_TIMEENTERMONITOR_BIT_POSITION       0
int32_t gt911_time_enter_monitor(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : PERIODACTIVE
* Address       : 0X88
* Bit Group Name:
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   GT911_PERIODACTIVE_BIT_MASK           0xFFU
#define   GT911_PERIODACTIVE_BIT_POSITION       0
int32_t gt911_period_active(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : PERIODMONITOR
* Address       : 0X89
* Bit Group Name:
* Permission    : RW
* Default value : 0x28
*******************************************************************************/
#define   GT911_PERIODMONITOR_BIT_MASK           0xFFU
#define   GT911_PERIODMONITOR_BIT_POSITION       0
int32_t gt911_period_monitor(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : RADIAN_VALUE
* Address       : 0X91
* Bit Group Name:
* Permission    : RW
* Default value : 0x0A
*******************************************************************************/
#define   GT911_RADIAN_VALUE_BIT_MASK           0xFFU
#define   GT911_RADIAN_VALUE_BIT_POSITION       0
int32_t gt911_radian_value(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : OFFSET_LEFT_RIGHT
* Address       : 0X92
* Bit Group Name:
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   GT911_OFFSET_LR_BIT_MASK           0xFFU
#define   GT911_OFFSET_LR_BIT_POSITION       0
int32_t gt911_offset_left_right(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : OFFSET_UP_DOWN
* Address       : 0X93
* Bit Group Name:
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   GT911_OFFSET_UD_BIT_MASK           0xFFU
#define   GT911_OFFSET_UD_BIT_POSITION       0
int32_t gt911_offset_up_down(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : DISTANCE_LEFT_RIGHT
* Address       : 0X94
* Bit Group Name:
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   GT911_DISTANCE_LR_BIT_MASK           0xFFU
#define   GT911_DISTANCE_LR_BIT_POSITION       0
int32_t  gt911_disatnce_left_right(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : DISTANCE_UP_DOWN
* Address       : 0X95
* Bit Group Name:
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   GT911_DISTANCE_UD_BIT_MASK           0xFFU
#define   GT911_DISTANCE_UD_BIT_POSITION       0
int32_t gt911_distance_up_down(gt911_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : DISTANCE_ZOOM
* Address       : 0X96
* Bit Group Name:
* Permission    : RW
* Default value : 0x32
*******************************************************************************/
#define   GT911_DISTANCE_ZOOM_BIT_MASK           0xFFU
#define   GT911_DISTANCE_ZOOM_BIT_POSITION       0
int32_t gt911_distance_zoom(gt911_ctx_t *ctx, uint8_t value);

